documentation/Manual.tex
% Created 2022-07-05 Tue 17:00
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{helvet}
\renewcommand{\familydefault}{\sfdefault}
\setcounter{secnumdepth}{2}
\date{\today}
\title{User and Deployment Manual}
\hypersetup{
 pdfauthor={Skyler Mayfield},
 pdftitle={User and Deployment Manual},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1.90 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Welcome to the Jungle}
\label{sec:org8b7dcf8}
A JavaScript pixel art RPG\\

\subsection{Group 7}
\label{sec:org7968f93}
\begin{itemize}
\item Max Ornik\\
\item Marcel Sziener\\
\item Skyler Mayfield\\
\end{itemize}

\subsection{Deployment}
\label{sec:org993be74}
\begin{enumerate}
\item Clone the repository\\
\begin{itemize}
\item \texttt{\$ git clone https://github.com/skyler544/it-project}\\
\end{itemize}
\item Navigate to the repository application directory with your shell or file browser.\\
\begin{itemize}
\item \texttt{\$ cd it-project/SourceCode}\\
\end{itemize}
\item Open \texttt{index.html} with the web browser of your choice\\
\begin{itemize}
\item \texttt{\$ firefox index.html}\\
\end{itemize}
\end{enumerate}

\subsection{Usage}
\label{sec:org3e23d59}
\begin{enumerate}
\item Play the game!\\
Controls:\\
\begin{itemize}
\item \texttt{w}, \texttt{a}, \texttt{s}, \texttt{d} or arrow keys for movement\\
\item \texttt{enter} to attack\\
\end{itemize}
Combat controls:\\
\begin{itemize}
\item Combat automatically begins when you encounter a monster; use the menu to select your action. Try not to die!\\
\end{itemize}
Use doors to move between levels.\\
\end{enumerate}

\subsection{Motivation}
\label{sec:org680113c}
As gamers ourselves, we were inspired by pixel art aesthetics and fond memories of playing pixel art games. Furthermore, since JavaScript is a very widely used language, we considered that making a large project in JavaScript would be a great way to sharpen our skills.\\

\subsection{Technology Used}
\label{sec:org9013e20}
\subsubsection*{JavaScript (obviously)}
\label{sec:orgdab23d9}
Some of the code makes use of jQuery as well.\\
\subsubsection*{Git}
\label{sec:org0c98276}
Using git effectively is a hard requirement of collaborative development. Version control not only makes developing code safer, it provides a form of documentation as well. Writing a commit message to explain what one did and why is an important consideration when working with others, especially if what the code does is not immediately obvious to everyone involved. Plus it's fun!\\
\subsubsection*{Trello}
\label{sec:org6a80287}
Having this project planning tool made keeping track of what exactly we were doing and how we wanted to do it much easier.\\
\subsubsection*{Discord}
\label{sec:org007aadb}
As a communications platform, Discord is hard to beat when it comes to staying connected and keeping each other in the loop.\\
\subsubsection*{Google Drive}
\label{sec:orgd63d5ef}
Realtime collaborative editing.\\
\subsubsection*{Emacs Org-Mode}
\label{sec:orgaddbdae}
Writing documentation and planning deadlines, \texttt{org-mode} does it all.\\

\subsection{Project Status}
\label{sec:org4f0a39a}
The game ``engine'' is finished. Everything needed to make the game possible is there. However, the project is still in what we would call ``alpha.'' There's enough to show that the game works, but it needs more levels and variety. The framework can easily be expanded to make this happen.\\

\noindent\rule{\textwidth}{0.5pt}
\subsection{A note about this document}
\label{sec:org972f3fc}
Both the Open Document and Latex versions of the document were generated using the free and open source tool \texttt{pandoc}.\\
\end{document}
